{
  "users": [
    {
      "id": 1,
      "name": "dylano",
      "email": "900152@student.glu.nl",
      "password": "password"
    },
    {
      "name": "admin",
      "email": "admin@glu.nl",
      "password": "admin",
      "id": 3
    }
  ],
  "courses": [
    {
      "id": 1,
      "title": "Leren wokken",
      "author": "Petra",
      "source": "https://www.24kitchen.nl/files/styles/960h_960w/public/2018-07/shutterstock_683463064.webp?itok=SsnIUITq",
      "publication_date": "07-12-2022",
      "intro_text_1": "In deze cursus leer je de basisprincipes van het wokken en hoe je heerlijke gerechten kunt bereiden.",
      "intro_text_2": "Ontdek verschillende woktechnieken en leer hoe je smaakvolle combinaties kunt maken.",
      "ingredients_subtitle": "Ingrediënten",
      "ingredients_intro": "Hier is een lijst met ingrediënten die je nodig hebt voor de gerechten:",
      "ingredients_list": "1 eetlepel plantaardige olie, 300 g kipfilet (in blokjes), 1 rode paprika (in reepjes), 1 gele paprika (in reepjes), 1 ui (gesnipperd), 2 teentjes knoflook (fijngehakt), 2 eetlepels sojasaus, 1 eetlepel oestersaus, 1 theelepel sesamolie, zout en peper naar smaak",
      "ingredients_additional_info": "Zorg ervoor dat je alle ingrediënten van tevoren klaarzet en bereidt.",
      "roadmap_subtitle": "Stappenplan",
      "roadmap_intro": "Volg deze stappen om het wokproces te doorlopen:",
      "roadmap": "Stap 1: Verhit de plantaardige olie in een wokpan op hoog vuur. Voeg de kipfilet toe en bak tot het gaar is. Haal de kip uit de pan en zet apart. Stap 2: Voeg de paprika, ui en knoflook toe aan de wokpan en roerbak gedurende 3-4 minuten, tot ze knapperig zijn. Stap 3: Voeg de gebakken kip toe aan de groenten in de pan. Giet de sojasaus, oestersaus en sesamolie erbij. Roerbak alles samen gedurende 1-2 minuten. Stap 4: Breng op smaak met zout en peper. Serveer direct en geniet van je heerlijke wokgerecht!",
      "roadmap_additional_info": "Experimenteer met verschillende groenten en sauzen om je eigen unieke wokrecepten te creëren."
    },
    {
      "id": 2,
      "title": "Pasta Recipes",
      "author": "Maria",
      "source": "https://previews.123rf.com/images/baibakova/baibakova1704/baibakova170400086/75557325-variety-of-types-and-shapes-uncooked-pasta-banner.jpg",
      "publication_date": "15-06-2023",
      "intro_text_1": "Learn how to make mouthwatering pasta dishes from scratch with this comprehensive course.",
      "intro_text_2": "Discover the art of making various pasta shapes and explore different pasta sauces.",
      "ingredients_subtitle": "Ingredients",
      "ingredients_intro": "Here is a list of ingredients you'll need for the recipes:",
      "ingredients_list": "250g pasta, 2 tablespoons olive oil, 3 cloves garlic (minced), 1 onion (chopped), 400g canned tomatoes, 1 teaspoon dried basil, 1 teaspoon dried oregano, salt and pepper to taste",
      "ingredients_additional_info": "Make sure to have all the ingredients prepared and ready before starting.",
      "roadmap_subtitle": "Roadmap",
      "roadmap_intro": "Follow these steps to prepare delicious pasta dishes:",
      "roadmap": "Step 1: Cook the pasta according to package instructions. Step 2: Heat olive oil in a pan and sauté garlic and onion until fragrant. Step 3: Add canned tomatoes, basil, and oregano. Simmer for 10 minutes. Step 4: Drain the cooked pasta and add it to the sauce. Mix well. Step 5: Season with salt and pepper. Serve hot and enjoy!",
      "roadmap_additional_info": "Experiment with different pasta shapes and sauces to create your own unique recipes."
    },
    {
      "id": 3,
      "title": "Baking Basics",
      "author": "Emily",
      "source": "https://images.squarespace-cdn.com/content/v1/5975441dbebafb04b95f650f/1674857954405-WTZ4AJ5FKJTGP5PQA0V2/12-week-basics-Banner-2023.jpg?format=1500w",
      "publication_date": "22-07-2023",
      "intro_text_1": "Master the essential baking techniques and create delectable homemade treats.",
      "intro_text_2": "Learn the secrets to perfect cakes, cookies, and pastries.",
      "ingredients_subtitle": "Ingredients",
      "ingredients_intro": "Here is a list of ingredients you'll need for the recipes:",
      "ingredients_list": "200g all-purpose flour, 150g unsalted butter (softened), 150g granulated sugar, 3 eggs, 1 teaspoon vanilla extract, 1 teaspoon baking powder, a pinch of salt",
      "ingredients_additional_info": "Ensure all the ingredients are at room temperature before starting.",
      "roadmap_subtitle": "Roadmap",
      "roadmap_intro": "Follow these steps to create delicious baked goods:",
      "roadmap": "Step 1: Preheat the oven to the desired temperature. Step 2: Cream the butter and sugar together until light and fluffy. Step 3: Add the eggs one at a time, mixing well after each addition. Step 4: Stir in the vanilla extract. Step 5: In a separate bowl, whisk together the flour, baking powder, and salt. Step 6: Gradually add the dry ingredients to the butter mixture and mix until just combined. Step 7: Transfer the batter to a greased baking pan. Step 8: Bake in the preheated oven for the specified time. Step 9: Remove from the oven and let cool before serving.",
      "roadmap_additional_info": "Experiment with different flavors and decorations to add your own personal touch."
    },
    {
      "id": 4,
      "title": "Asian Cuisine",
      "author": "Zhongli",
      "source": "https://static.vecteezy.com/system/resources/previews/015/511/644/non_2x/asian-food-banner-asian-cuisine-with-various-dishes-illustration-vector.jpg",
      "publication_date": "10-08-2023",
      "intro_text_1": "Explore the vibrant and diverse flavors of Asian fusion cuisine.",
      "intro_text_2": "Learn how to create delicious dishes inspired by the culinary traditions of Asia.",
      "ingredients_subtitle": "Ingredients",
      "ingredients_intro": "Here is a list of ingredients you'll need for the recipes:",
      "ingredients_list": "2 cups cooked jasmine rice, 200g chicken breast (sliced), 1 bell pepper (sliced), 1 carrot (julienned), 1 onion (sliced), 2 cloves garlic (minced), 2 tablespoons soy sauce, 1 tablespoon oyster sauce, 1 teaspoon sesame oil, salt and pepper to taste",
      "ingredients_additional_info": "Prepare all the ingredients and have them ready before you start cooking.",
      "roadmap_subtitle": "Roadmap",
      "roadmap_intro": "Follow these steps to create flavorful Asian fusion dishes:",
      "roadmap": "Step 1: Heat oil in a wok or pan and cook the chicken until browned. Set aside. Step 2: In the same pan, stir-fry the vegetables until tender-crisp. Step 3: Return the chicken to the pan and add soy sauce, oyster sauce, and sesame oil. Stir-fry for a few more minutes. Step 4: Season with salt and pepper. Step 5: Serve the stir-fried chicken and vegetables over cooked jasmine rice. Enjoy!",
      "roadmap_additional_info": "Experiment with different combinations of vegetables and sauces to create your own unique Asian fusion recipes."
    },
    {
      "title": "Spanish Delights",
      "author": "Maria",
      "source": "https://adelady.com.au/wp-content/uploads/2020/11/naomigiatas-food35-1.jpg",
      "publication_date": "28-09-2023",
      "intro_text_1": "Embark on a culinary journey to the Mediterranean with these delightful recipes.",
      "intro_text_2": "Discover the rich flavors and healthy ingredients that make Mediterranean cuisine so popular.",
      "ingredients_subtitle": "Ingredients",
      "ingredients_intro": "Here is a list of ingredients you'll need for the recipes:",
      "ingredients_list": "2 cups cherry tomatoes, 1 cucumber (diced), 1 red onion (sliced), 1 bell pepper (sliced), 200g feta cheese (crumbled), 1/4 cup Kalamata olives, 2 tablespoons extra virgin olive oil, 1 tablespoon lemon juice, salt and pepper to taste",
      "ingredients_additional_info": "Make sure to use fresh and high-quality ingredients for the best results.",
      "roadmap_subtitle": "Roadmap",
      "roadmap_intro": "Follow these steps to create Mediterranean-inspired dishes:",
      "roadmap": "Step 1: In a large bowl, combine the cherry tomatoes, cucumber, red onion, bell pepper, feta cheese, and Kalamata olives. Step 2: In a small bowl, whisk together the olive oil, lemon juice, salt, and pepper to make the dressing. Step 3: Drizzle the dressing over the salad and toss to combine. Step 4: Serve the Mediterranean salad as a refreshing appetizer or side dish.",
      "roadmap_additional_info": "Feel free to add your favorite Mediterranean herbs and spices to enhance the flavors.",
      "id": 5
    },
    {
      "id": 6,
      "title": "Gourmet Pizza",
      "author": "Luigi",
      "source": "https://as1.ftcdn.net/v2/jpg/03/61/36/06/1000_F_361360627_KWSYzckppRCiw9T0nBNCAqQhcUyLDJxO.jpg",
      "publication_date": "05-11-2023",
      "intro_text_1": "Learn the art of making gourmet pizzas from scratch with this hands-on course.",
      "intro_text_2": "Discover the techniques for creating delicious dough, flavorful sauces, and creative toppings.",
      "ingredients_subtitle": "Ingredients",
      "ingredients_intro": "Here is a list of ingredients you'll need for the recipes:",
      "ingredients_list": "2 cups all-purpose flour, 1 teaspoon instant yeast, 1 teaspoon sugar, 1/2 teaspoon salt, 3/4 cup warm water, 2 tablespoons olive oil, pizza sauce, mozzarella cheese, your favorite toppings",
      "ingredients_additional_info": "Feel free to experiment with different cheeses, meats, and vegetables for your toppings.",
      "roadmap_subtitle": "Roadmap",
      "roadmap_intro": "Follow these steps to create gourmet pizzas:",
      "roadmap": "Step 1: In a large bowl, combine the flour, instant yeast, sugar, and salt. Step 2: Gradually add warm water and olive oil to the mixture. Mix until the dough comes together. Step 3: Knead the dough on a floured surface until smooth and elastic. Step 4: Place the dough in a greased bowl, cover with a damp cloth, and let it rise for about an hour. Step 5: Preheat the oven to the highest temperature. Step 6: Roll out the dough into your desired pizza shape. Step 7: Spread pizza sauce over the dough and add your favorite toppings. Step 8: Bake in the preheated oven for 10-12 minutes or until the crust is golden and the cheese is melted and bubbly. Step 9: Remove from the oven and let it cool slightly before slicing and serving.",
      "roadmap_additional_info": "Get creative with your pizza toppings and try new flavor combinations."
    },
    {
      "id": 7,
      "title": "Smoothies",
      "author": "Julia",
      "source": "https://www.shutterstock.com/image-vector/fresh-mix-berries-smoothie-banner-260nw-1512582737.jpg",
      "publication_date": "13-12-2023",
      "intro_text_1": "Discover the world of healthy and delicious smoothies with this refreshing course.",
      "intro_text_2": "Learn how to make nutritious smoothies packed with vitamins and minerals.",
      "ingredients_subtitle": "Ingredients",
      "ingredients_intro": "Here is a list of ingredients you'll need for the recipes:",
      "ingredients_list": "1 banana, 1 cup mixed berries, 1 cup spinach, 1/2 cup almond milk, 1 tablespoon honey, ice cubes (optional)",
      "ingredients_additional_info": "Feel free to customize your smoothies with additional fruits, vegetables, or superfood powders.",
      "roadmap_subtitle": "Roadmap",
      "roadmap_intro": "Follow these steps to create healthy and refreshing smoothies:",
      "roadmap": "Step 1: Place all the ingredients in a blender. Step 2: Blend until smooth and creamy. Step 3: If desired, add ice cubes and blend again until chilled. Step 4: Pour the smoothie into a glass and enjoy!",
      "roadmap_additional_info": "Experiment with different flavor combinations and adjust the sweetness to your taste."
    },
    {
      "id": 8,
      "title": "Bread Baking",
      "author": "Bart",
      "source": "https://t3.ftcdn.net/jpg/02/53/67/14/360_F_253671488_aYv6Uo2cqdUGpiZSiiFoLs5dE8zYRALr.jpg",
      "publication_date": "20-01-2024",
      "intro_text_1": "Master the art of artisan bread baking and create crusty, flavorful loaves at home.",
      "intro_text_2": "Learn the techniques for working with different types of dough and achieving professional results.",
      "ingredients_subtitle": "Ingredients",
      "ingredients_intro": "Here is a list of ingredients you'll need for the recipes:",
      "ingredients_list": "500g bread flour, 10g instant yeast, 10g salt, 350ml water",
      "ingredients_additional_info": "Consider using high-quality bread flour for the best texture and flavor.",
      "roadmap_subtitle": "Roadmap",
      "roadmap_intro": "Follow these steps to bake artisan bread:",
      "roadmap": "Step 1: In a large bowl, combine the bread flour, instant yeast, and salt. Step 2: Gradually add water and mix until the dough comes together. Step 3: Knead the dough on a floured surface for about 10 minutes or until smooth and elastic. Step 4: Place the dough in a greased bowl, cover with a damp cloth, and let it rise for about 1-2 hours or until doubled in size. Step 5: Preheat the oven to the desired temperature. Step 6: Shape the dough into a loaf or rolls. Step 7: Place the shaped dough on a baking sheet or in a loaf pan. Step 8: Let the dough rise for another 30-45 minutes. Step 9: Bake in the preheated oven for about 20-30 minutes or until golden brown and sounds hollow when tapped. Step 10: Remove from the oven and let it cool on a wire rack before slicing and serving.",
      "roadmap_additional_info": "Experiment with different types of flours, seeds, and spices to create unique bread variations."
    },
    {
      "id": 9,
      "title": "Sushi Making",
      "author": "Xiangling",
      "source": "https://d368g9lw5ileu7.cloudfront.net/races/races-123xxx/123003/raceBanner-5bApwxnB-bHYIt6.jpg",
      "publication_date": "28-02-2024",
      "intro_text_1": "Immerse yourself in the art of sushi making with this comprehensive masterclass.",
      "intro_text_2": "Learn the techniques for preparing sushi rice, rolling sushi rolls, and creating beautiful presentations.",
      "ingredients_subtitle": "Ingredients",
      "ingredients_intro": "Here is a list of ingredients you'll need for sushi making:",
      "ingredients_list": "Sushi rice, nori seaweed sheets, fresh fish or vegetables for filling, soy sauce, wasabi, pickled ginger",
      "ingredients_additional_info": "Ensure you have all the necessary tools, such as a bamboo sushi mat and sharp knives, for sushi making.",
      "roadmap_subtitle": "Roadmap",
      "roadmap_intro": "Follow these steps to create delicious sushi rolls:",
      "roadmap": "Step 1: Prepare sushi rice according to the package instructions. Step 2: Place a sheet of nori on a bamboo sushi mat. Step 3: Wet your hands and spread a thin layer of sushi rice on the nori, leaving a small border at the top. Step 4: Add your choice of filling ingredients along the bottom edge of the rice. Step 5: Roll the sushi tightly using the bamboo mat, applying gentle pressure. Step 6: Use a sharp knife to slice the sushi roll into bite-sized pieces. Step 7: Serve the sushi rolls with soy sauce, wasabi, and pickled ginger.",
      "roadmap_additional_info": "Experiment with different fillings and sushi roll variations to create your own sushi masterpieces."
    },
    {
      "id": 10,
      "title": "French Pastry",
      "author": "Hans",
      "source": "https://blog.paul-uk.com/wp-content/uploads/2020/04/Banner-1.png",
      "publication_date": "10-04-2024",
      "intro_text_1": "Indulge in the world of French pastries and learn the secrets of classic delicacies.",
      "intro_text_2": "Master the art of creating flaky croissants, creamy éclairs, and elegant tarts.",
      "ingredients_subtitle": "Ingredients",
      "ingredients_intro": "Here is a list of ingredients commonly used in French pastry recipes:",
      "ingredients_list": "Butter, flour, eggs, sugar, milk, vanilla extract, chocolate, fruits, pastry cream",
      "ingredients_additional_info": "Each French pastry recipe may require specific ingredients and techniques.",
      "roadmap_subtitle": "Roadmap",
      "roadmap_intro": "Follow these steps to create French pastry delights:",
      "roadmap": "Step 1: Prepare the dough or batter according to the specific recipe. Step 2: Shape the dough or pour the batter into the desired forms. Step 3: Bake the pastries in a preheated oven until golden brown and cooked through. Step 4: Allow the pastries to cool completely before filling or decorating. Step 5: Fill the pastries with pastry cream, whipped cream, or other delicious fillings. Step 6: Decorate the pastries with chocolate ganache, fruit compote, or powdered sugar. Step 7: Enjoy the French pastry creations!",
      "roadmap_additional_info": "French pastry requires precision and attention to detail. Practice and patience will help you achieve the best results."
    }
  ]
}